// 큰 값이 오른쪽으로 이동하는 걸 볼 수 있다(그래서 버블정렬)
// 하나하나 생각해가면서 적어보았는데 이해가 훨씬 잘 되는 듯

// 선택 정렬은 정말 선택해서 자리를 바꾸는 거 였다면 버블 정렬은 가까운 요소를 비교해서 조건에 맞으면 자리를 바꿈

function solution(arr) {
  let answer = arr;

  for (let i = 0; i < arr.length - 1; i++) {
    for (let j = 0; j < arr.length - i - 1; j++) {
      // j < 6 - 0 - 1 = 5
      // j < 6 - 1 - 1 = 4
      // j < 6 - 2 - 1 = 3
      // j < 2

      if (arr[j] > arr[j + 1]) {
        // arr[0]: 13 > arr[j+1]: 5 ->  arr = [5, 13, 11, 7, 23, 15];
        // arr[1]: 13 > arr[j+1]: 11 -> arr = [5, 11, 13, 7, 23, 15]
        // arr[2]: 13 > arr[j+1]: 7 -> arr = [5, 11, 7, 13, 23, 15]
        // arr[3]: 13 < arr[j+1]: 23 -> pass
        // arr[4]: 23 > arr[j+1]: 15 -> arr = [5, 11, 7, 13, 15, 23]

        // --------------------

        // arr[0]: 5 <  arr[j+1]: 11 -> pass
        // arr[1]: 11 >  arr[j+1]: 7 -> arr = [5, 7, 11, 13, 15, 23]
        // arr[2]: 7 < arr[j+1]: 13 -> pass

        // 계속 반복

        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];

        console.log(arr, "arr");
        // [5, 13, 11, 7, 23, 15] 'arr'
        // [5, 11, 13, 7, 23, 15] 'arr'
        // [5, 11, 7, 13, 23, 15] 'arr'
        // [5, 11, 7, 13, 15, 23] 'arr'
        // [5, 7, 11, 13, 15, 23] 'arr'
      }
    }
  }

  return answer;
}

let arr = [13, 5, 11, 7, 23, 15];
console.log(solution(arr));
